RhinoInside.Revit API Documentation
GeometryEncoder.ToPolyLine Method
 Converts the specified Polyline to an equivalent Revit PolyLine.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Autodesk.Revit.DB.PolyLine ToPolyLine(
	this Rhino.Geometry.Polyline value
)
@staticmethod
def ToPolyLine(
	value: Rhino.Geometry.Polyline
) -> Autodesk.Revit.DB.PolyLine
Parameters
value
Type: Rhino.Geometry.Polyline
A value to convert.
Return Value
Type: Autodesk.Revit.DB.PolyLine
A Revit PolyLine that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Polyline. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace